const inquirer = require('inquirer');
const { EOL } = require('os');
const figlet = require('figlet');
const chalk = require('chalk');

class View {
  static async getUserInfo(themes) {
    return await inquirer.prompt([
      { name: 'userName', type: 'input', message: 'Введи своё имя:' },
      {
        name: 'theme',
        type: 'list',

        message: 'Выбери тему викторины:',
        choices: themes,
      },
    ]);
  }

  static async greetUser(username) {
    console.log(chalk.cyan(figlet.textSync(`Hi  little  wolf`)));
    console.log(chalk.magenta(figlet.textSync(`${username}`)));
  }

  static async greetings() {
    console.log(
      chalk.gray(
        `
░██       ░██   ░██████   ░██         ░██    ░██ ░██████████   ░██████   
░██       ░██  ░██   ░██  ░██         ░██    ░██ ░██          ░██   ░██  
░██  ░██  ░██ ░██     ░██ ░██         ░██    ░██ ░██         ░██         
░██ ░████ ░██ ░██     ░██ ░██         ░██    ░██ ░█████████   ░████████  
░██░██ ░██░██ ░██     ░██ ░██          ░██  ░██  ░██                 ░██ 
░████   ░████  ░██   ░██  ░██           ░██░██   ░██          ░██   ░██  
░███     ░███   ░██████   ░██████████    ░███    ░██████████   ░██████   
                                                                         
                                                                         
                                                                         
                 🐺 ДОБРО ПОЖАЛОВАТЬ В ВОЛЧЬИ ИСПЫТАНИЯ!                           
         🦷 Ответь на вопросы и докажи, что достоин Клыка Альфы! 
`,
      ),
    );
  }

  static async askQuestion(q) {
    

    const { userAnswer } = await inquirer.prompt([
      {
        type: 'input',
        name: 'userAnswer',
        message: q.question,
        
      },
    ]);

    return userAnswer;
  }

  static showMiddleRes(isTrue, q) {
    if (isTrue) {
      console.log(
        chalk.green(
          `
   /\\    /\\  
  /  \\__/  \\   🎉 Ты прав, сородич!  
 (  /\\  /\\  )  🐺 Волчья стая воет в твою честь: "А-У-У-У-У-У-У!"  
  \\/  \\/  \\/   🦷 +1 клык к твоей добыче!  
`,
        ),
      );
    } else {
      console.log(
        chalk.red(
          `${EOL}  
   /\\    /\\  
  /  \\__/  \\      😆 "Ха-ха-ха, это же очевидно!"  
 ( <->  <-> )  ❌ Неправильно!  
  \// ++ \\ /   🐺 Волки смотрят на тебя с большим чувством голода...  
   \\____///_  Правильный ответ: 
                   ${q.correct}${EOL}`,
        ),
      );
    }
  }

  static showResult(score, total) {
    if (score === 0) {
      console.log(
        chalk.red(`  
░██████████   ░███    ░██████░██         ░██████████ ░███████   
░██          ░██░██     ░██  ░██         ░██         ░██   ░██  
░██         ░██  ░██    ░██  ░██         ░██         ░██    ░██ 
░█████████ ░█████████   ░██  ░██         ░█████████  ░██    ░██ 
░██        ░██    ░██   ░██  ░██         ░██         ░██    ░██ 
░██        ░██    ░██   ░██  ░██         ░██         ░██   ░██  
░██        ░██    ░██ ░██████░██████████ ░██████████ ░███████   `),
      );
    } else if (score === total) {
      console.log(
        chalk.green(`
░██     ░██ ░███    ░██ ░████████   ░██████████ ░██         ░██████░██████████ ░██    ░██    ░███    ░████████   ░██         ░██████████ 
░██     ░██ ░████   ░██ ░██    ░██  ░██         ░██           ░██  ░██         ░██    ░██   ░██░██   ░██    ░██  ░██         ░██         
░██     ░██ ░██░██  ░██ ░██    ░██  ░██         ░██           ░██  ░██         ░██    ░██  ░██  ░██  ░██    ░██  ░██         ░██         
░██     ░██ ░██ ░██ ░██ ░████████   ░█████████  ░██           ░██  ░█████████  ░██    ░██ ░█████████ ░████████   ░██         ░█████████  
░██     ░██ ░██  ░██░██ ░██     ░██ ░██         ░██           ░██  ░██          ░██  ░██  ░██    ░██ ░██     ░██ ░██         ░██         
 ░██   ░██  ░██   ░████ ░██     ░██ ░██         ░██           ░██  ░██           ░██░██   ░██    ░██ ░██     ░██ ░██         ░██         
  ░██████   ░██    ░███ ░█████████  ░██████████ ░██████████ ░██████░██████████    ░███    ░██    ░██ ░█████████  ░██████████ ░██████████ 
`),
      );
      console.log(
        chalk.magenta(`${EOL}Ты настоящий волчара. У тебя ${score} 🦷 из ${total}${EOL}`),
      );
      console.log(
        chalk.blue(`
████████╗██╗  ██╗███████╗     ███████╗███╗   ██╗██████╗ 
╚══██╔══╝██║  ██║██╔════╝     ██╔════╝████╗  ██║██╔══██╗
   ██║   ███████║█████╗       █████╗  ██╔██╗ ██║██║  ██║
   ██║   ██╔══██║██╔══╝       ██╔══╝  ██║╚██╗██║██║  ██║
   ██║   ██║  ██║███████╗     ███████╗██║ ╚████║██████╔╝
   ╚═╝   ╚═╝  ╚═╝╚══════╝     ╚══════╝╚═╝  ╚═══╝╚═════╝ `),
      );
    } else if (score > 0) {
      console.log(
        chalk.white(`

                                        ░██                                            ░██     ░████ 
                                        ░██                                            ░██    ░██    
 ░████████  ░███████   ░███████   ░████████    ░██    ░██    ░██  ░███████   ░███████  ░██ ░████████ 
░██    ░██ ░██    ░██ ░██    ░██ ░██    ░██    ░██    ░██    ░██ ░██    ░██ ░██    ░██ ░██    ░██    
░██    ░██ ░██    ░██ ░██    ░██ ░██    ░██     ░██  ░████  ░██  ░██    ░██ ░██    ░██ ░██    ░██    
░██   ░███ ░██    ░██ ░██    ░██ ░██   ░███      ░██░██ ░██░██   ░██    ░██ ░██    ░██ ░██    ░██    
 ░█████░██  ░███████   ░███████   ░█████░██       ░███   ░███     ░███████   ░███████  ░██    ░██    
       ░██                                                                                           
 ░███████                                                                                            `),
      );
      console.log(
        `${EOL}У тебя ${score} 🦷 из ${total}, сегодня пятничное полнолуние, предлагаю повыть у меня)${EOL}`,
      );
      console.log(
        chalk.yellow(`
░██                                                                     ░██                                                                 ░██                                    ░██ 
░██                                                                                                                                         ░██                                    ░██ 
░████████   ░██████   ░██    ░██  ░███████      ░██████      ░████████  ░██ ░███████   ░███████     ░██    ░██    ░██  ░███████   ░███████  ░██    ░██ ░███████  ░████████   ░████████ 
░██    ░██       ░██  ░██    ░██ ░██    ░██          ░██     ░██    ░██ ░██░██    ░██ ░██    ░██    ░██    ░██    ░██ ░██    ░██ ░██    ░██ ░██   ░██ ░██    ░██ ░██    ░██ ░██    ░██ 
░██    ░██  ░███████   ░██  ░██  ░█████████     ░███████     ░██    ░██ ░██░██        ░█████████     ░██  ░████  ░██  ░█████████ ░█████████ ░███████  ░█████████ ░██    ░██ ░██    ░██ 
░██    ░██ ░██   ░██    ░██░██   ░██           ░██   ░██     ░██    ░██ ░██░██    ░██ ░██             ░██░██ ░██░██   ░██        ░██        ░██   ░██ ░██        ░██    ░██ ░██   ░███ 
░██    ░██  ░█████░██    ░███     ░███████      ░█████░██    ░██    ░██ ░██ ░███████   ░███████        ░███   ░███     ░███████   ░███████  ░██    ░██ ░███████  ░██    ░██  ░█████░██ `),
      );
    }
  }
}

module.exports = View;
////
